app/views/people/_people_thumbs.html.erb

SELECT COUNT(*) FROM "projects" INNER JOIN "ownerships" ON "projects"."id" = "ownerships"."project_id" WHERE "ownerships"."person_id" = $1  [["person_id", 1]]
---
              <div class="blacktext">
                <%=person.projects.count %> <text class="small">trabalho<%=my_pluralize(person.projects.count)%></text>