app/views/shared/_tag_cloud.html.erb

		tags.each_with_index do |t,i|
			count[i] = t.projects.count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "taggings" ON "projects"."id" = "taggings"."project_id" WHERE "taggings"."tag_id" = 2