app/views/projects/show.html.erb


  <% if not @project.tags.empty? %>
---
SELECT  1 AS one FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."project_id" = $1 LIMIT 1  [["project_id", 1]]

      <p>
        <% if @project.people.size==1 %>
---
SELECT "people".* FROM "people" INNER JOIN "ownerships" ON "people"."id" = "ownerships"."person_id" WHERE "ownerships"."project_id" = $1  [["project_id", 1]]
SELECT COUNT(*) FROM "people" INNER JOIN "ownerships" ON "people"."id" = "ownerships"."person_id" WHERE "ownerships"."project_id" = $1  [["project_id", 1]]

      <div>
        <h4><i class="icon-link"></i> Links (<%=@project.links.count%>)</h4>
---
SELECT "links".* FROM "links" WHERE "links"."project_id" = $1  [["project_id", 1]]
SELECT COUNT(*) FROM "links" WHERE "links"."project_id" = $1  [["project_id", 1]]

      <p>
        <h3><i class="icon-comments"></i> Comentários (<%= @project.comments.size %>)</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."project_id" IN (1)