app/controllers/global_search_controller.rb

	def index
		@projects = @courses = @people = @tags = []

	    if params[:gq] and !params[:gq].empty?
	    	@hasQuery = true
	    	@query = params[:gq]

	    	@projects = Project.all.includes(:people)
		    @courses = Course.all
		    @people = Person.all
		    @tags = Tag.all

			# Projects search
			@projects = @projects.search(@query)
			@totalProjects = @projects.size
			@projects.sort_by{|p| p.relevance }.reverse
			@projects = @projects[0..MAX_PROJECTS-1]

			# Courses search
			@courses = @courses.search(@query).order("name DESC")
			@totalCourses = @courses.size

			# People search
			@people = @people.search(@query).order("created_at DESC")
			@totalPeople = @people.size
			@people = @people.limit(MAX_PEOPLE)

			# Tags search
			@tags = @tags.search(@query).order("tag_text DESC")
			@totalTags = @tags.size

			@numResults = @totalProjects + @totalCourses + @totalPeople + @totalTags

			SearchLog.create(text: @query,
				    		ip: request.remote_ip,
				    		user: (user_signed_in? ? current_user : nil),
				    		resultsCount: @numResults)
---
SELECT "people".* FROM "people" WHERE "people"."id" IN (1)
SELECT "projects".* FROM "projects" INNER JOIN "courses" ON "courses"."id" = "projects"."course_id" WHERE ((title ILIKE '%t%' OR tags_str ILIKE '%t%' OR description ILIKE '%t%' OR name ILIKE '%t%'))
SELECT "courses".* FROM "courses" WHERE ((name ILIKE '%t%' OR code ILIKE '%t%'))  ORDER BY name DESC
SELECT "tags".* FROM "tags" WHERE ((tag_text ILIKE '%t%'))  ORDER BY tag_text DESC
SELECT COUNT(*) FROM "people" WHERE ((name ILIKE '%t%' OR nick ILIKE '%t%'))
SELECT COUNT(*) FROM "projects" INNER JOIN "courses" ON "courses"."id" = "projects"."course_id" WHERE ((title ILIKE '%t%' OR tags_str ILIKE '%t%' OR description ILIKE '%t%' OR name ILIKE '%t%'))
SELECT COUNT(*) FROM "courses" WHERE ((name ILIKE '%t%' OR code ILIKE '%t%'))
SELECT COUNT(*) FROM "tags" WHERE ((tag_text ILIKE '%t%'))
INSERT INTO "search_logs" ("text", "ip", "user_id", "resultsCount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "t"], ["ip", "127.0.0.1"], ["user_id", 1], ["resultsCount", 88], ["created_at", "2018-10-15 02:04:09.254353"], ["updated_at", "2018-10-15 02:04:09.254353"]]