app/controllers/people_controller.rb

  def show
    if params[:id]
      search = Person.where(nick: params[:id])

      if search.empty?
        not_found
      else
        @person = search.first
        @allProjects = @person.projects.includes(:course)

        handleProjectsParams

        @allProjects = @allProjects.all

        # Handle sortings
        handleProjectsSorting @allProjects, params[:sort], params[:direction]

        # Do pagination
        @allProjects = @allProjects.paginate(per_page: PROJECTS_PER_PAGE_PROFILE, page: params[:page])

        # Default view is LIST
        @viewMode = (!params[:view] or params[:view].empty? or params[:view]=="list") ? :list : :thumbs

        @hideAuthors = true

        # User's activities list
        @activities = PublicActivity::Activity.where(owner_id: @person.user.id).order("created_at desc").includes(:owner).includes(:trackable).includes(:recipient)

        # User's personal favorites projects
        @favoriteProjects = @person.favorites.paginate(per_page: PROJECTS_PER_PAGE_PROFILE, page: params[:page])

        # Tags for personal tagcloud
        @tags = Tag.joins(:taggings).group("tags.id").where("taggings.project_id" => @person.project_ids)
---
SELECT  "projects".* FROM "projects" INNER JOIN "ownerships" ON "projects"."id" = "ownerships"."project_id" WHERE "ownerships"."person_id" = $1 LIMIT 16 OFFSET 0  [["person_id", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN (72)
SELECT COUNT(*) FROM "projects" INNER JOIN "ownerships" ON "projects"."id" = "ownerships"."project_id" WHERE "ownerships"."person_id" = $1  [["person_id", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."owner_id" = $1  ORDER BY created_at desc LIMIT 1  [["owner_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "activities" WHERE "activities"."owner_id" = $1  [["owner_id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "taggings"."tag_id" = "tags"."id" WHERE "taggings"."project_id" = 1 GROUP BY tags.id