app/controllers/projects_controller.rb

	def index
		# if params[:id]
  #     		search = Person.where(nick: params[:id])
  #     		if search.empty?
  #       		not_found
  #       	else
  #       		@projects = search.first.projects
  #       	end
  #       else
			@projects = Project.all
		# end

		@projects = @projects.includes(:people)

		handleProjectsParams()

		@projects = @projects.all

		# Handle sorting
		handleProjectsSorting @projects, params[:sort], params[:direction]

		# Do pagination
		@projects = @projects.paginate(per_page: PROJECTS_PER_PAGE, page: params[:page])
---
SELECT "projects".* FROM "projects"
SELECT "people".* FROM "people" WHERE "people"."id" IN (1)
SELECT  "projects".* FROM "projects" LIMIT 24 OFFSET 0
SELECT COUNT(*) FROM "projects"

	def show

		# Test if we're doing it github style
		# if params[:person] && params[:project]
		#   user = Person.find_by_nick(params[:person])
		#   @project = user.projects.includes(:comments).find_by_title(params[:project]) if user
		# else
			@project = Project.includes(:comments).find(params[:id])

		not_found if @project.nil?

		@project.update_attribute :viewCount, @project.viewCount+1
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."project_id" IN (1)
UPDATE "projects" SET "viewCount" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["viewCount", 2], ["updated_at", "2018-10-15 01:16:53.103636"], ["id", 1]]